app/controllers/beers_controller.rb

  def create
    @beer = Beer.new(beer_params)

    if @beer.save
---
INSERT INTO "beers" ("beer_id", "seen_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["beer_id", "Electric India"], ["seen_at", "Vibrant Hoppy Saison."], ["user_id", 1], ["created_at", "2021-05-05 23:05:32.331415"], ["updated_at", "2021-05-05 23:05:32.331415"]]