app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
  def index
    @favorites = Favorite.all

INSERT INTO "favorites" ("beer_id", "user_id", "created_at", "updated_at", "fav") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["beer_id", 1], ["user_id", 1], ["created_at", "2021-05-05 23:53:01.822575"], ["updated_at", "2021-05-05 23:53:01.822575"], ["fav", 1]]
---
  def create
    @favorite = Favorite.new(favorite_params)

    if @favorite.save